{
  "profile": {
    "en": {
      "intro": "Full stack project for the development of a web application for simultaneous sharing of data between users with registration and login for insertion and also development of application diagrams, database, CI/CD and deployment in AWS.",
      "kind": "Open Source",
      "name": "Web platform for sharing data between users"
    },
    "es": {
      "intro": "Proyecto full stack para el desarrollo de una aplicación web para el intercambio simultáneo de datos entre usuarios con registro e inicio de sesión para la inserción y también desarrollo de diagramas de aplicación, base de datos, CI/CD y despliegue en AWS.",
      "kind": "Open Source",
      "name": "Plataforma web para compartir datos entre usuarios"
    },
    "fr": {
      "intro": "Projet full stack pour le développement d'une application web de partage simultané de données entre utilisateurs avec inscription et login pour insertion et également développement de schémas d'application, base de données, CI/CD et déploiement dans AWS.",
      "kind": "Open Source",
      "name": "Plateforme Web de partage de données entre utilisateurs"
    },
    "pt": {
      "intro": "Projeto full stack para desenvolvimento de uma aplicação web para compartilhamento simultâneo de dados entre usuários com cadastro e login para inserção e, também desenvolvimento de diagramas de aplicação, banco de dados, CI/CD e implantação na AWS.",
      "kind": "Open Source",
      "name": "Plataforma Web para compartilhamento de dados entre usuários"
    }
  },
  "stack": {
    "backend": [
      {
        "name": "Node.js",
        "tags": [
          "TypeScript",
          "Express",
          "Jest",
          "Husky",
          "eslint"
        ]
      }
    ],
    "cloud": [
      {
        "name": "Amazon AWS",
        "tags": [
          "AWS CloudFront",
          "AWS S3 Bucket",
          "AWS Elastic Beanstalk",
          "AWS CodeDeploy",
          "AWS CodePipeline",
          "AWS CodeCommit",
          "AWS EC2 instance"
        ]
      }
    ],
    "database": [
      {
        "name": "PostgreSQL",
        "tags": []
      }
    ],
    "frontend": [
      {
        "name": "React",
        "tags": [
          "TypeScript",
          "Material-UI",
          "Styled-components",
          "Redux",
          "Redux-Saga",
          "Hooks"
        ]
      }
    ]
  },
  "tags": [
    "React",
    "Node.js",
    "PostgreSQL",
    "TypeScript",
    "Express",
    "Material-UI",
    "Styled-components",
    "Redux",
    "JavaScript",
    "Amazon AWS",
    "Full-stack", 
    "Front-end", 
    "Back-end"
  ]
}
